status/2022/0715.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>09 July 2022 - 15 July 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">09 July 2022 - 15 July 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org34e76c3">1. MIT OCW</a>
<ul>
<li><a href="#org1726d24">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#org32b95ac">1.1.1. Session 71-27, PS9</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org5c80255">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#orgf09cedb">2.1. Have inductor selector - started desoldering</a></li>
</ul>
</li>
<li><a href="#orgb2c7394">3. Mill Controller #2</a>
<ul>
<li><a href="#orgf4f337d">3.1. PXE install of CentOS 6.10</a>
<ul>
<li><a href="#org33cf4dd">3.1.1. Available systems don't have enough ememory</a></li>
</ul>
</li>
<li><a href="#orgf455d2c">3.2. May need to clone existing HD</a></li>
<li><a href="#orge41d3c0">3.3. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#org3eeea67">3.3.1. Old crap ain't gonna last forever</a></li>
<li><a href="#org5742aa4">3.3.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org3a79456">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org2deae5b">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#org6a0328d">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#orgc17f050">5. OLPC</a>
<ul>
<li><a href="#orgd0599c3">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#org8c22f63">6. Virtual Orchestra</a>
<ul>
<li><a href="#org9dac6f0">6.1. sfz file tests</a>
<ul>
<li><a href="#org2c85c63">6.1.1. Started new audio tool program to replace aftools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4e0e7d8">7. David Davies</a>
<ul>
<li><a href="#org900e405">7.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#orgd05175d">7.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org9d697ae">7.3. Next hearing 9/6/2022</a></li>
</ul>
</li>
<li><a href="#orgd310c27">8. Peter Kim</a>
<ul>
<li><a href="#org377b08f">8.1. Broadcom CSG Employee indicted for trade secret theft.</a></li>
<li><a href="#orga8bd262">8.2. United States v. Kim (5:21-cr-00438).</a></li>
<li><a href="#orgf80968e">8.3. Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</a></li>
<li><a href="#orgbd6217f">8.4. Sentencing 9/20/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org34e76c3" class="outline-2">
<h2 id="org34e76c3"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1726d24" class="outline-3">
<h3 id="org1726d24"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-org32b95ac" class="outline-4">
<h4 id="org32b95ac"><span class="section-number-4">1.1.1.</span> Session 71-27, PS9</h4>
</div>
</div>
</div>
<div id="outline-container-org5c80255" class="outline-2">
<h2 id="org5c80255"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgf09cedb" class="outline-3">
<h3 id="orgf09cedb"><span class="section-number-3">2.1.</span> Have inductor selector - started desoldering</h3>
</div>
</div>
<div id="outline-container-orgb2c7394" class="outline-2">
<h2 id="orgb2c7394"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgf4f337d" class="outline-3">
<h3 id="orgf4f337d"><span class="section-number-3">3.1.</span> PXE install of CentOS 6.10</h3>
<div class="outline-text-3" id="text-3-1">
</div>
<div id="outline-container-org33cf4dd" class="outline-4">
<h4 id="org33cf4dd"><span class="section-number-4">3.1.1.</span> Available systems don't have enough ememory</h4>
</div>
</div>
<div id="outline-container-orgf455d2c" class="outline-3">
<h3 id="orgf455d2c"><span class="section-number-3">3.2.</span> May need to clone existing HD</h3>
</div>
<div id="outline-container-orge41d3c0" class="outline-3">
<h3 id="orge41d3c0"><span class="section-number-3">3.3.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-3">
</div>
<div id="outline-container-org3eeea67" class="outline-4">
<h4 id="org3eeea67"><span class="section-number-4">3.3.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-org5742aa4" class="outline-4">
<h4 id="org5742aa4"><span class="section-number-4">3.3.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
</div>
</div>
</div>
<div id="outline-container-org3a79456" class="outline-2">
<h2 id="org3a79456"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2deae5b" class="outline-3">
<h3 id="org2deae5b"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-org6a0328d" class="outline-3">
<h3 id="org6a0328d"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-orgc17f050" class="outline-2">
<h2 id="orgc17f050"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgd0599c3" class="outline-3">
<h3 id="orgd0599c3"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-org8c22f63" class="outline-2">
<h2 id="org8c22f63"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org9dac6f0" class="outline-3">
<h3 id="org9dac6f0"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org2c85c63" class="outline-4">
<h4 id="org2c85c63"><span class="section-number-4">6.1.1.</span> Started new audio tool program to replace aftools</h4>
</div>
</div>
</div>
<div id="outline-container-org4e0e7d8" class="outline-2">
<h2 id="org4e0e7d8"><span class="section-number-2">7.</span> David Davies</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org900e405" class="outline-3">
<h3 id="org900e405"><span class="section-number-3">7.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-orgd05175d" class="outline-3">
<h3 id="orgd05175d"><span class="section-number-3">7.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org9d697ae" class="outline-3">
<h3 id="org9d697ae"><span class="section-number-3">7.3.</span> Next hearing 9/6/2022</h3>
</div>
</div>
<div id="outline-container-orgd310c27" class="outline-2">
<h2 id="orgd310c27"><span class="section-number-2">8.</span> Peter Kim</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org377b08f" class="outline-3">
<h3 id="org377b08f"><span class="section-number-3">8.1.</span> Broadcom CSG Employee indicted for trade secret theft.</h3>
</div>
<div id="outline-container-orga8bd262" class="outline-3">
<h3 id="orga8bd262"><span class="section-number-3">8.2.</span> United States v. Kim (5:21-cr-00438).</h3>
</div>
<div id="outline-container-orgf80968e" class="outline-3">
<h3 id="orgf80968e"><span class="section-number-3">8.3.</span> Change of Plea Hearing Held 5/10/2022 (Guilty on various counts)</h3>
</div>
<div id="outline-container-orgbd6217f" class="outline-3">
<h3 id="orgbd6217f"><span class="section-number-3">8.4.</span> Sentencing 9/20/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>